ГТС/УТГТС/DataProcessors/ПомощникКопированияНастроекУчетныхПолитик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПомощникКопированияНастроекУчетныхПолитик</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ГТС/УТГТС/InformationRegisters/СтавкиДисконтирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтавкиДисконтирования</Name>
			<Comment>Дополняет учетную политику финансового учета ставками дисконтирования в разных валютах</Comment>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтавкаДисконтирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/InformationRegisters/НастройкиСистемыНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиСистемыНалогообложения</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СистемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяЕНВД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯвляетсяПлательщикомНДПИ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПереходаНаУСН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УведомлениеНомерУСН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УведомлениеДатаУСН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикНалогаНаПрибыль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяПСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяАУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикЕНП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикНДД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/InformationRegisters/УчетнаяПолитикаФинансовогоУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УчетнаяПолитикаФинансовогоУчета</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МетодОценкиСтоимостиТоваров</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыОценкиСтоимостиТоваров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчетГотовойПродукцииПоПлановойСтоимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПризнаватьРасходыПоИсследованиям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяРасходовПоИсследованиям</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АналитикаРасходовПоИсследованиям</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьВыделениеДолгосрочныхАктивовОбязательств</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлительностьОперационногоЦикла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокУчетаВНА</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокУчетаВНАРегл</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокУчетаВНАРегл</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокНачисленияАмортизацииОС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокНачисленияАмортизацииОСРегл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокНачисленияАмортизацииАренда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокНачисленияАмортизацииАрендаРегл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокНачисленияАмортизацииНМА</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокНачисленияАмортизацииНМАРегл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДетализироватьМатериальныеИПостатейныеЗатратыВСебестоимостиТоваров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчетАрендыПоФСБУ25_2018</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МесяцНачалаФинансовогоГода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантПроводокПоОбесценениюВНА</Name>
					<Comment>Начислять амортизацию на полную (не обесцененную) стоимость и сторнировать корректировку обесценения (истина) или начислять амортизацию на обесцененную стоимость и доначислять корректировку обесценения (ложь) по IAS 36</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчетДисконтированнойКредиторскойЗадолженностиПоставщикам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяСписанияПроцентныхРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АналитикаСписанияПроцентныхРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДляПримененияДисконтирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчетДисконтированияРезервовПредстоящихРасходов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяСписанияПроцентныхРасходовДисконтированияРезервов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АналитикаСписанияПроцентныхРасходовДисконтированияРезервов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормироватьРезервыПоСомнительнымДолгам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьРезервовПоСомнительнымДолгам</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокОценкиЗадолженности</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВосстанавливатьРезервПриСписанииЗапасовНаРасходы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяПроцентныхДоходовФинансовойАренды</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АналитикаПроцентныхДоходовФинансовойАренды</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиДоходов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяДоходовДляУслугФинансовойАренды</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АналитикаДоходовДляУслугФинансовойАренды</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиДоходов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизводитПодакцизныйТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмпортируетПодакцизныйТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодПереоценкиОС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодПереоценкиНМА</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДетализироватьОтклоненияПоНаправлениямДеятельности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДетализироватьОтклоненияПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДетализироватьОтклоненияПоСкладам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СписыватьОтклоненияВСтоимостиПродукцииНаСебестоимостьПродаж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеВестиДетализациюДоДокументовПоступления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/InformationRegisters/НастройкиУчетаНДСПриУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаНДСПриУСН</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОсновноеНалогообложение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/DataProcessors/ПомощникКопированияНастроекУчетныхПолитик/Forms/Форма/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ОбновитьФормуОрганизации;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	УстановитьУсловноеОформление();

	КопированиеИзДругойОрганизации = Параметры.КопированиеИзДругойОрганизации;
	Элементы.ОписаниеНастройкиСистемыНалогообложенияСлужебный.Видимость = Не КопированиеИзДругойОрганизации;
	
	Если КопированиеИзДругойОрганизации Тогда
		ОрганизацииПриемники.Добавить(Параметры.Организация);
		Элементы.ДекорацияОрганизации.Заголовок = НСтр("ru = 'Выберите организацию-источник копирования настроек.'");
	Иначе
		ОрганизацияИсточник = Параметры.Организация;
		Элементы.ГруппаСтраницыПомощника.ТекущаяСтраница = Элементы.ГруппаСтраницаВыборНастроек;
		ЗаполнитьОписаниеНастроекУстановитьВидимость();
	КонецЕсли;
	
	Период = НачалоМесяца(ТекущаяДатаСеанса());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОрганизацияЗаполнения", Параметры.Организация);
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("КопированиеИзДругойОрганизации", КопированиеИзДругойОрганизации);
	
	Запрос.Текст = ТекстЗапросаОрганизацииДляКопированияНастроек();
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();

	Если РезультатЗапроса[2].Пустой() Тогда
		Отказ = Истина;
		ТекстОшиибки = СтрШаблон(
			НСтр("ru = 'У организации ""%1"" не заполнена система налогообложения, копирование настроек учетной политики невозможно.'"), Параметры.Организация);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшиибки);
		
	Иначе
		ТекущаяСистемаНалогообложения = РезультатЗапроса[2].Выгрузить()[0].СистемаНалогообложения;
		Элементы.ДекорацияОтборОрганизаций.Заголовок = СтрШаблон(Элементы.ДекорацияОтборОрганизаций.Заголовок, ТекущаяСистемаНалогообложения);
		Элементы.ОписаниеНастройкиСистемыНалогообложенияСлужебный.Заголовок = СтрШаблон(Элементы.ОписаниеНастройкиСистемыНалогообложенияСлужебный.Заголовок, 
			ТекущаяСистемаНалогообложения);
		
		Если РезультатЗапроса[3].Пустой() Тогда
			Отказ = Истина;
			ТекстОшибки = СтрШаблон(
				НСтр("ru = 'Отсутствуют организации с системой налогообложения ""%1"" для копирования настроек учетной политики.'"), ТекущаяСистемаНалогообложения);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		Иначе
			Выборка = РезультатЗапроса[3].Выбрать();
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = ТаблицаОрганизации.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				Если Выборка.КопироватьСистемуНалогообложения Тогда
					СкопироватьНастройкиСистемыНалогообложения = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ТаблицаОрганизацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если КопированиеИзДругойОрганизации Тогда
		ПерейтиКВыборуНастроек();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)

	Если КопированиеИзДругойОрганизации И Элементы.ГруппаСтраницыПомощника.ТекущаяСтраница = Элементы.ГруппаСтраницаВыборОрганизаций Тогда 
		ПерейтиКВыборуНастроек();
		
	ИначеЕсли НЕ КопированиеИзДругойОрганизации И Элементы.ГруппаСтраницыПомощника.ТекущаяСтраница = Элементы.ГруппаСтраницаВыборНастроек Тогда
		Если ЕстьНастройкиДляКопирования() Тогда
			Элементы.ГруппаСтраницыПомощника.ТекущаяСтраница = Элементы.ГруппаСтраницаВыборОрганизаций;
			Элементы.ФормаНазад.Доступность = Истина;
			Элементы.ФормаДалее.Заголовок = НСтр("ru = 'Далее'");
		КонецЕсли;
		
	ИначеЕсли КопированиеИзДругойОрганизации И Элементы.ГруппаСтраницыПомощника.ТекущаяСтраница = Элементы.ГруппаСтраницаВыборНастроек
		ИЛИ НЕ КопированиеИзДругойОрганизации И Элементы.ГруппаСтраницыПомощника.ТекущаяСтраница = Элементы.ГруппаСтраницаВыборОрганизаций Тогда

		Если ЕстьНастройкиДляКопирования() И СкопироватьНастройки() Тогда
			ОбновитьФормуОрганизации = КопированиеИзДругойОрганизации;
			Элементы.ФормаНазад.Доступность = Ложь;
			Элементы.ФормаДалее.Заголовок = НСтр("ru = 'Готово'");
			Элементы.ГруппаСтраницыПомощника.ТекущаяСтраница = Элементы.ГруппаСтраницаИтог;
		КонецЕсли;
		
	ИначеЕсли Элементы.ГруппаСтраницыПомощника.ТекущаяСтраница = Элементы.ГруппаСтраницаИтог Тогда
		Закрыть(ОбновитьФормуОрганизации);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)

	Если КопированиеИзДругойОрганизации И Элементы.ГруппаСтраницыПомощника.ТекущаяСтраница = Элементы.ГруппаСтраницаВыборНастроек Тогда
		Элементы.ГруппаСтраницыПомощника.ТекущаяСтраница = Элементы.ГруппаСтраницаВыборОрганизаций;
		Элементы.ФормаНазад.Доступность = Ложь;
		
	ИначеЕсли Не КопированиеИзДругойОрганизации И Элементы.ГруппаСтраницыПомощника.ТекущаяСтраница = Элементы.ГруппаСтраницаВыборОрганизаций Тогда
		Элементы.ГруппаСтраницыПомощника.ТекущаяСтраница = Элементы.ГруппаСтраницаВыборНастроек;
		Элементы.ФормаНазад.Доступность = Ложь;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПерейтиКВыборуНастроек()
	
		Элементы.ГруппаСтраницыПомощника.ТекущаяСтраница = Элементы.ГруппаСтраницаВыборНастроек;
		Элементы.ФормаНазад.Доступность = Истина;
		Элементы.ФормаДалее.Заголовок = НСтр("ru = 'Далее'");
		ОрганизацияИсточник = Элементы.ТаблицаОрганизации.ТекущиеДанные.Организация;
		
		ЗаполнитьОписаниеНастроекУстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаОрганизацииПометка.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КопированиеИзДругойОрганизации");;
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

КонецПроцедуры

&НаСервере
Функция СкопироватьНастройки()

	ТЗ = РеквизитФормыВЗначение("ТаблицаОрганизации");
	
	Если Не КопированиеИзДругойОрганизации Тогда
		ВыбранныеОрганизации = ТЗ.Скопировать(Новый Структура("Пометка", Истина));
		
		Если Не ВыбранныеОрганизации.Количество() Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не выбрана ни одна организация для копирования настроек.'"));
			Возврат Ложь;
		Иначе
			ОрганизацииПриемники.Очистить();
			Для Каждого Организация Из ВыбранныеОрганизации Цикл
				ОрганизацииПриемники.Добавить(Организация.Организация,,Организация.КопироватьСистемуНалогообложения);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	//Считываем настройки из организации источника
	НастройкиДляКопирования = Новый СписокЗначений();

	НастройкиДляКопирования.Добавить("НастройкиСистемыНалогообложения",	НСтр("ru = 'Настройки системы налогообложения'"), СкопироватьНастройкиСистемыНалогообложения);
	НастройкиДляКопирования.Добавить("НастройкиУчетаНДС",				НСтр("ru = 'Настройки учета НДС'"), СкопироватьНастройкиУчетаНДС);
	НастройкиДляКопирования.Добавить("НастройкиУчетаНДСПриУСН",			НСтр("ru = 'Настройки учета НДС при УСН'"), СкопироватьНастройкиУчетаНДС);
	НастройкиДляКопирования.Добавить("УчетнаяПолитикаФинансовогоУчета",	НСтр("ru = 'Учетная политика финансового учета'"), СкопироватьУчетнаяПолитикаФинансовогоУчета);

	// Формирование текстов запроса.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОрганизацияИсточник", ОрганизацияИсточник);
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	
	ТекстыЗапроса = Новый СписокЗначений;
	МассивВыбранныхНастроек = Новый Массив();
	БлокировкаДанных = Новый БлокировкаДанных();

	Для Каждого НастройкаУчетнойПолитики Из НастройкиДляКопирования Цикл
		Если НастройкаУчетнойПолитики.Пометка Тогда
			ИмяНастройки = НастройкаУчетнойПолитики.Значение;
			ТекстыЗапроса.Добавить(ТекстЗапросаНастройки(ИмяНастройки), "Таблица"
				+ ИмяНастройки);
			МассивВыбранныхНастроек.Добавить(НастройкаУчетнойПолитики.Представление);
			
			ПространствоБлокировки = СтрШаблон("РегистрСведений.%1", ИмяНастройки);
			ЭлементБлокировки = БлокировкаДанных.Добавить(ПространствоБлокировки);
			ЭлементБлокировки.УстановитьЗначение("Организация", ОрганизацияИсточник);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
			
			Если НастройкаУчетнойПолитики.Значение = "УчетнаяПолитикаФинансовогоУчета" Тогда
				ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.СтавкиДисконтирования");
				ЭлементБлокировки.УстановитьЗначение("Организация", ОрганизацияИсточник);
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//Копируем настройки учетной политики
	НачатьТранзакцию();
	
	Попытка
		
		// Инициализация таблиц.
		БлокировкаДанных.Заблокировать();
		ТаблицыРезультатов = ОбщегоНазначенияУТ.ВыгрузитьРезультатыЗапроса(Запрос, ТекстыЗапроса, ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Для Каждого ОрганизацияНастройка Из ОрганизацииПриемники Цикл
			Для Каждого НастройкаУчетнойПолитики Из ТаблицыРезультатов Цикл
				Если НастройкаУчетнойПолитики.Значение.Строки.Количество() 
					И (ОрганизацияНастройка.Пометка И НастройкаУчетнойПолитики.Ключ = "НастройкиСистемыНалогообложения"
						ИЛИ Не НастройкаУчетнойПолитики.Ключ = "НастройкиСистемыНалогообложения") Тогда
					
					Организация = ОрганизацияНастройка.Значение;
					ИмяРегистра = СтрЗаменить(НастройкаУчетнойПолитики.Ключ, "Таблица", "");
					КлючЗаписи = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(КлючЗаписи, НастройкаУчетнойПолитики.Значение.Строки[0]);
					КлючЗаписи.Организация = Организация;
					Если НастройкаУчетнойПолитики.Ключ = "ТаблицаНастройкиУчетаНДС" Тогда
						КлючЗаписи.Период = НачалоКвартала(Период);
					КонецЕсли;
					КлючЗаписи.Период = Период;
					КлючЗаписи.Записать(Истина);
					
					Если ИмяРегистра = "УчетнаяПолитикаФинансовогоУчета" Тогда
						НаборЗаписей = РегистрыСведений.СтавкиДисконтирования.СоздатьНаборЗаписей();
						НаборЗаписей.Отбор.Организация.Установить(ОрганизацияИсточник);
						НаборЗаписей.Отбор.Период.Установить(НастройкаУчетнойПолитики.Значение.Строки[0].Период);
						НаборЗаписей.Прочитать();
						Если НаборЗаписей.Выбран() Тогда 
							ТаблицаСтавок = НаборЗаписей.Выгрузить();
							ТаблицаСтавок.ЗаполнитьЗначения(Период, "Период");
							ТаблицаСтавок.ЗаполнитьЗначения(Организация, "Организация");
							НаборЗаписей = РегистрыСведений.СтавкиДисконтирования.СоздатьНаборЗаписей();
							НаборЗаписей.Отбор.Организация.Установить(Организация);
							НаборЗаписей.Отбор.Период.Установить(Период);
							НаборЗаписей.Загрузить(ТаблицаСтавок);
							НаборЗаписей.Записать(Истина);
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Элементы.ГруппаИтогУспешно.Видимость = Истина;
		
		УстановитьЗаголовокДекорацияИтоги(МассивВыбранныхНастроек, ВыбранныеОрганизации);

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		УстановитьЗаголовокДекорацияИтоги();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Копирование настроек учетной политики'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначения.СообщитьПользователю(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат Истина;

КонецФункции

&НаКлиенте
Функция ЕстьНастройкиДляКопирования()
	
	ОчиститьСообщения();
	
	НастройкаВыделены = Ложь;
	Если СкопироватьНастройкиУчетаНалогаНаПрибыль
		Или СкопироватьНастройкиУчетаНДС
		Или СкопироватьНастройкиУчетаУСН
		Или СкопироватьСтавкиНалогаНаИмущество
		Или СкопироватьУчетнаяПолитикаБухУчета
		Или СкопироватьУчетнаяПолитикаФинансовогоУчета Тогда
		НастройкаВыделены = Истина;
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрана ни одна настройка для копирования.'"));
	КонецЕсли;
	
	Возврат НастройкаВыделены;
КонецФункции

&НаСервере
Процедура УстановитьЗаголовокДекорацияИтоги(МассивНастроек = Неопределено, ОписанияОрганизаций = Неопределено)
	
	Элементы.ДекорацияИтоги.Видимость = Истина;
	Если МассивНастроек = Неопределено Тогда
		Элементы.ГруппаИтогОшибка.Видимость = Истина;
		Элементы.ДекорацияИтоги.Заголовок = НСтр("ru = 'Во время копирования настроек учетных политик произошла ошибка, подробности см. в Журнале регистрации.'");
	Иначе
		Отсутп = Новый ФорматированнаяСтрока(БиблиотекаКартинок.Пустая);
		МассивСтрок = Новый Массив();
		
		МассивСтрок.Добавить(НСтр("ru = 'Скопированы настройки:'") + Символы.ПС);
		
		Для Каждого Настройка Из МассивНастроек Цикл
			МассивСтрок.Добавить(Отсутп);
			МассивСтрок.Добавить(Отсутп);
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Настройка + Символы.ПС,,ЦветаСтиля.ЦветТекстаФормы));
		КонецЦикла;
		
		Если НЕ ОписанияОрганизаций = Неопределено Тогда
			МассивСтрок.Добавить(НСтр("ru = 'Для организаций:'") + Символы.ПС);
			
			Для Каждого ОписаниеОрганизации Из ОписанияОрганизаций Цикл
				МассивСтрок.Добавить(Отсутп);
				МассивСтрок.Добавить(Отсутп);
				МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Строка(ОписаниеОрганизации.Организация) + Символы.ПС, , , , ПолучитьНавигационнуюСсылку(ОписаниеОрганизации.Организация)));
			КонецЦикла;
		КонецЕсли;
		
		Элементы.ДекорацияИтоги.Заголовок = Новый ФорматированнаяСтрока(МассивСтрок);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОписаниеНастроекУстановитьВидимость()
	
	СоответствиеЭлементов = Справочники.Организации.СоответствиеЭлементовФормыПараметрамНалоговУчетныхПолитик();
	НастройкиНалоговУчетныхПолитик.УправлениеВидимостьюЭлементовУчетныхПолитик(ЭтотОбъект, СоответствиеЭлементов, ОрганизацияИсточник);
	НастройкиНалоговУчетныхПолитик.ЗаполнитьОписаниеДействующихПараметров(ЭтотОбъект, ОрганизацияИсточник, "");
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаОрганизацииДляКопированияНастроек()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиСистемыНалогообложенияСрезПоследних.СистемаНалогообложения КАК СистемаНалогообложения
	|ПОМЕСТИТЬ НалообложениеОрганизацииЗаполнения
	|ИЗ
	|	РегистрСведений.НастройкиСистемыНалогообложения.СрезПоследних(&Период, Организация = &ОрганизацияЗаполнения
	|	И СистемаНалогообложения <> ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.ПустаяСсылка)) КАК
	|		НастройкиСистемыНалогообложенияСрезПоследних
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(НастройкиСистемыНалогообложенияСрезПоследних.СистемаНалогообложения,
	|		ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.ПустаяСсылка)) КАК СистемаНалогообложения,
	|	Организации.ГоловнаяОрганизация КАК Организация,
	|	ВЫБОР
	|		КОГДА НастройкиСистемыНалогообложенияСрезПоследних.СистемаНалогообложения ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК КопироватьСистемуНалогообложения
	|ПОМЕСТИТЬ Организации
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиСистемыНалогообложения.СрезПоследних(&Период,
	|			Организация <> &ОрганизацияЗаполнения
	|		И Организация <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)) КАК
	|			НастройкиСистемыНалогообложенияСрезПоследних
	|		ПО (НастройкиСистемыНалогообложенияСрезПоследних.Организация = Организации.Ссылка)
	|ГДЕ
	|	Организации.Ссылка <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|	И Организации.ГоловнаяОрганизация <> &ОрганизацияЗаполнения
	|	И Организации.ОбособленноеПодразделение = ЛОЖЬ
	|	И Организации.ПометкаУдаления = ЛОЖЬ
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НалообложениеОрганизацииЗаполнения.СистемаНалогообложения КАК СистемаНалогообложения
	|ИЗ
	|	НалообложениеОрганизацииЗаполнения КАК НалообложениеОрганизацииЗаполнения
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Организации.Организация КАК Организация,
	|	Организации.КопироватьСистемуНалогообложения
	|ИЗ
	|	НалообложениеОрганизацииЗаполнения КАК НалообложениеОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Организации КАК Организации
	|		ПО НалообложениеОрганизации.СистемаНалогообложения = Организации.СистемаНалогообложения
	|		ИЛИ (НЕ &КопированиеИзДругойОрганизации
	|		И Организации.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.ПустаяСсылка))
	|УПОРЯДОЧИТЬ ПО
	|	Организация
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаНастройки(Настройка)

	Если Настройка = "УчетнаяПолитикаФинансовогоУчета" Тогда
		ТекстЗапроса = "////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	*
		|ИЗ
		|	РегистрСведений.УчетнаяПолитикаФинансовогоУчета.СрезПоследних(&Период, Организация = ВЫРАЗИТЬ(&ОрганизацияИсточник
		|		КАК Справочник.Организации).ГоловнаяОрганизация) КАК УчетнаяПолитикаФинансовогоУчетаСрезПоследних";
		
	ИначеЕсли Настройка = "НастройкиСистемыНалогообложения" Тогда
			ТекстЗапроса = "
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	*
			|ИЗ
			|	РегистрСведений.НастройкиСистемыНалогообложения.СрезПоследних(&Период, Организация = ВЫРАЗИТЬ(&ОрганизацияИсточник КАК Справочник.Организации).ГоловнаяОрганизация) КАК НастройкиСистемыНалогообложенияСрезПоследних
			|;
			|";
		
	ИначеЕсли Настройка = "НастройкиУчетаНДС" Тогда
		ТекстЗапроса = "
			|		
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	*
			|ИЗ
			|	РегистрСведений.НастройкиУчетаНДС.СрезПоследних(&Период, Организация = ВЫРАЗИТЬ(&ОрганизацияИсточник КАК Справочник.Организации).ГоловнаяОрганизация) КАК НастройкиУчетаНДССрезПоследних
			|;
			|";
	ИначеЕсли Настройка = "НастройкиУчетаНДСПриУСН" Тогда
		ТекстЗапроса = "
			|		
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	*
			|ИЗ
			|	РегистрСведений.НастройкиУчетаНДСПриУСН.СрезПоследних(&Период, Организация = ВЫРАЗИТЬ(&ОрганизацияИсточник КАК Справочник.Организации).ГоловнаяОрганизация) КАК НастройкиУчетаНДСПриУСНСрезПоследних
			|;
			|";	
	КонецЕсли;
	
	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти
